 
N = [14.8, 14.9, 15, 15.1, 15.2, 15.3, 15.4, 15.5, 15.6, 15.7];  
 
w1 = [100, 93.10, 77.71, 65.81, 60.37, 53.29, 44.97, 32.18, 9.28, 0];   
w2 = [0,    6.90, 22.27, 34.18, 39.63, 46.67, 55.01, 67.78, 90.72, 100];

 
figure;                

 
plot(N, w1, '-o', ...             
    'Color', [0.8 0.7 1], ...     
    'LineWidth', 1.5, ...         
    'MarkerSize', 6, ...         
    'DisplayName','w_1');         
hold on;                         

 
plot(N, w2, '-o', ...
    'Color', [0.5 0 0.5], ...     
    'LineWidth', 1.5, ...
    'MarkerSize', 6, ...
    'DisplayName','w_2');

 
legend('Location','best');        % 让MATLAB自动选择最佳位置放置图例

 
xlabel('N 参数');                 % X轴标签
ylabel('w_1、w_2 百分比 (%)');   % Y轴标签

 
title('w_1 : w_2 随不同 N 参数的变化');  % 给图加一个标题

 
grid on;                          % 打开网格显示，便于读取数据
